Тип 5 10309
1) Автомат получает на вход пятизначное число. По этому числу строится новое число по следующим правилам.
1.Складываются отдельно первая, третья и пятая цифры, а также вторая и четвёртая цифры.
2.Полученные два числа записываются друг за другом в порядке неубывания без разделителей.

Пример. Исходное число: 63 179. Суммы: 6 + 1 + 9 = 16; 3 + 7 = 10. Результат: 1016.
Укажите наименьшее число, при обработке которого автомат выдаёт результат 621.

Тип 5 13733


2) На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.

1)Строится двоичная запись числа N.
2)К этой записи дописываются справа ещё два разряда по следующему правилу:
а) складываются все цифры двоичной записи числа N, и остаток от деления суммы на 2 дописывается в конец числа (справа).
Например, запись 11100 преобразуется в запись 111001;
б) над этой записью производятся те же действия – справа дописывается остаток от деления суммы её цифр на 2.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, которое превышает число 83 и может являться результатом работы данного алгоритма.
В ответе это число запишите в десятичной системе счисления.

3) Написать алгоритм евклида для нахождения НОД и НОД двх чисел.
4) Написать программу по склыдыванию двух дробей a/b + c/d
