# # 10639
# # for x in range(1,100):
# #     if not(x<=14) and (x<=18):
# #         print (x)
#
#
# #10636
# # x%2==0 # четное
# # x%2==1 # нечетное
#
# # for x in range(-100,100):
# #     if not(x<9) and not(x%2==1):
# #         print (x)
#
# #18033
# #x%3==0 кратно 3 ( делится на 3 без остатка)
#
# for x in range(100,999+1):
#     if not(x%2==1) and (x%3==0):
#         print (x)

#
# # №18212
#
# #x//10 -- первая цифра двузначного числа
# #x//100 первая цифра трехзначного числа
#
# #x//10%10  вторая цифра больше чем двузначного числа
#
# #for x in range(10,99+1):
# #10877
#
#
# for x in range (1,100):
#     if not (x <= 8) and not (x >= 15) and (x%2==0):
#         print(x)
#
#
#

#10386
s="11121"

for b in range(1,100):
    d=4
    for x in s:
        if x=='1':
            d=d+2
        else:
            d=d*b
    if d==72:
        print (b)
# ((((4+2)+2)+2)*b)+2 =72
#10b+2=72


for b in range(1,100):
    if 10*b+2==72:
        print (b)

