
# 59713
# Составляют 5-буквенные слова из букв слова ПЯТНИЦА.
# Найти количество слов, которые не начинаются с Н и в которых есть только одна буква Я. Буквы в слове могут повторяться.



# 59745
Все 5-буквенные слова, в составе которых могут быть буквы А, Л, Г, О, Р, И, Т, М, записаны в алфавитном порядке
и пронумерованы начиная с 1.
Определите в этом списке количество слов с нечетными номерами,
которые не начинаются с буквы Г и при этом содержат в своей записи не менее двух букв И.


# 59831
Игорь составляет пятизначные числа, используя цифры девятеричной системы счисления.
Сколько различных чисел может составить Игорь, в которых только одна цифра 5 и рядом с ней НЕ стоят нечётные цифры?