# # хочу вывести числа трехзначные оканчивающиеся на 7 или 3
# # 100 - 999
#
# for i in range(100,1000):
#     if i %10 ==7 or i%10 ==3:
#         print (i)
















# for i in range(100,1000):
#     if i%10==7 or i%10==3:
#         print (i)
#
#
# # # хочу вывести числа трехзначные оканчивающиеся на 7 и начинающиеся на 2
# #
# for i in range(100,1000):
#     if i%10==7 and i//100==2:
#          print(i)
#
# #
# for i in range(200,300):
#     if i%10==7 :
#         print(i)
# #
# хочу вывести числа < 999 оканчивающиеся на 7 и начинающиеся на 2

# for i in range(1,1000):
#     if i%10==7  and str(i)[0]=='2':
#         print(i)



# # ХОЧУ ВЫВЕСТИ ВСЕ ТРЕХЗНАЧНЫЕ ЧИСЛА СРЕДНЯЯ ЦИФРА 6 а последняя 5
for i in range(100,1000):
    if str(i)[1]=='6' and str(i)[2]=='5':
        print (i)
#
#
# for i in range(165,1000,100):
#     print (i)

#1 четырехзначные числа кратные 5

#2  четырехзначные числа оканичивающиеся на 3 и начинающиеся на 7

#3 четырехначные числа в середине 72
